BOT_TOKEN = "YOUR_BOT_TOKEN"
ADMIN_IDS = [7164894029, 6408912033, 5634735018]

TEST_QUESTIONS = [
    {
        'question': "Указать свои имя и фамилию(не относится к правильным/не правильным ответам)",
        'type': 'name_input'
    },
    {
        'question': "Какова основная цель вашей деятельности как создателя контента для LEXINST?",
        'options': [
            "а) Стать вирусной знаменитостью",
            "б) Создать 'океан качественного контента' для прорыва в информационном шуме", 
            "в) Только монтировать видео",
            "г) Общаться с подписчиками в комментариях"
        ],
        'correct': 1
    },
    {
        'question': "Какое вознаграждение вы получаете за каждого нового клиента, совершившего покупку по вашему промокоду?",
        'options': [
            "а) 1500 рублей",
            "б) 500 рублей",
            "в) 15% от суммы заказа"
        ],
        'correct': 1
    },
    {
        'question': "Что является 'Ключевой стратегией' для максимального заработка?",
        'options': [
            "а) Создание одного, но очень дорогого видео",
            "б) Массовость охвата промокода через видеоконтент на разных платформах",
            "в) Покупка рекламы у блогеров"
        ],
        'correct': 1
    },
    {
        'question': "Какова основная задача механики 'Call to Action' (Призыв к действию)?",
        'options': [
            "а) Сделать видео короче",
            "б) Увеличить процент конверсии зрителей в клиентов",
            "в) Улучшить качество картинки", 
            "г) Получить больше лайков"
        ],
        'correct': 1
    },
    {
        'question': "Где создатели контента могут найти готовые видео- и фото-материалы для интеграции в свои ролики?",
        'options': [
            "а) На публичном YouTube-канале LEXINST",
            "б) В закрытом канале для создателей контента",
            "в) Создавать все материалы самостоятельно"
        ],
        'correct': 1
    },
    {
        'question': "Какие комментарии необходимо НЕМЕДЛЕННО удалять из-под ваших видео?",
        'options': [
            "а) Только комментарии с конкурирующими промокодами",
            "б) Все комментарии без исключения",
            "в) Оскорбительные, провокационные и негативные высказывания о продукте, цене и бренде"
        ],
        'correct': 2
    },
    {
        'question': "Какое из следующих действий НЕ является нарушением правил сообщества?",
        'options': [
            "а) Вдохновляться идеями и стилем монтажа другого создателя",
            "б) Прямое копирование чужого контента и выдача его за свой", 
            "в) Накрутка просмотров и лайков",
            "г) Использование платной рекламы для продвижения роликов"
        ],
        'correct': 0
    },
    {
        'question': "Что произойдет, если модератор обнаружит под вашим видео множество неудаленных негативных и оскорбительных комментариев?",
        'options': [
            "а) Вам сразу начислят бонус",
            "б) Вас сразу забанят без предупреждения",
            "в) Сначала вынесено предупреждение, а при повторении — отказ в выплате",
            "г) Ничего, это нормально"
        ],
        'correct': 2
    },
    {
        'question': "Какова минимальная сумма, при достижении которой можно подать заявку на выплату?",
        'options': [
            "а) 500 рублей",
            "б) 50 000 рублей", 
            "в) 1 500 рублей",
            "г) минимальной суммы нет"
        ],
        'correct': 2
    },
    {
        'question': "Какой основной принцип продвижения других брендов в рамках работы с LEXINST?",
        'options': [
            "а) Можно продвигать любые бренды, кроме казино.",
            "б) Запрещено параллельное продвижение других брендов; вся деятельность должна быть посвящена исключительно LEXINST.",
            "в) Можно продвигать другие бренды, если указать промокод LEXINST.",
            "г) Ограничений нет."
        ],
        'correct': 1
    }
]

MATERIALS_CHANNEL = "https://t.me/+MCIiMB4H1FI2MjVi"
STARTER_PACK_LINK = "https://telegra.ph/STARTER-PAK-NAREZCHIKA-11-14"
INFO_LINK = "https://telegra.ph/Prikladnaya-infa-po-narezkam-11-14"
SUPPORT_LINK = "@lexinst_manager"